{"VersionBase":"3.0","publishVersionCode":377,"ApkUrl":"https://github.com/fgl27/SmartTwitchTV/releases/download/377/SmartTV_twitch_3_0_377.apk","WebVersion":"June 13 2025","WebTag":713,"changelog":[{"title":"Version June 13","changes":["Added Sync across devices, Backup, and Restore using Google Drive","Sync across devices is disabled by default. It is recommended to enable it only if you use the app on multiple devices with the same Google Drive account","Notifications: Added background notification support for Android 11 and above. This uses a simplified single-line text notification while running in the background","Chat VOD: Improved chat synchronization when starting playback. For VODs of an ongoing live stream, there was a chance the chat could take a long time to load and/or sync","Player: Added rewind button for live streams. This plays the VOD of the current live (when available) stream starting from the most recent point","User Live Feed (accessed by pressing Up on the player): Live history now shows the last 100 watched channels that are Live","User Live Feed (accessed by pressing Up on the player): Re-added the User VODs section","Player: Removed buffer settings since they no longer provide any benefit in the current player version","Updated Ukrainian language translation by @sladkOy","General performance improvements and bug fixes"]},{"title":"Version June 07","changes":["Add Ukraine application language by @sladkOy"]},{"title":"Version June 03","changes":["Enhanced Broadcasting support for HEVC/AV1 codecs now enabled by default on compatible devices","Upgraded from \"Extra codec support\" to \"Enhanced Broadcasting\" with improved HEVC/AV1 implementation","Most streams use AVC (H.264) up to 1080p60, while HEVC/AV1 enable higher quality 1440p, 4K, and 60+fps streams where available","Device compatibility is automatically detected to ensure optimal streaming performance","Access the new setting in player options to enable/disable Enhanced Broadcasting support based on your preferences","General improvements to streaming performance and stability"]}]}